Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་རྣམ་པར་སྤྱོད་པ་ཡིན་ཏེ།
en: They course through the factors conducive to enlightenment.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་མི་བྱེད་དོ།
en: But they do not actualize the fruit of entering the stream to nirvāṇa.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་མངོན་དུ་མི་བྱེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ཞིག་དཔའ་ཞིང་རྩལ་ཆེ་ལ་ཤིན་ཏུ་བརྟན་ཞིང་།
en: They do not actualize the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, the fruit of arhatship, or individual enlightenment. “

source: གཟུགས་མཛེས་ལ། བྱད་བཞིན་བཟང་ཞིང་བལྟ་ན་སྡུག་པ་ཁ་དོག་བཟང་པོ་མཆོག་ཏུ་རྒྱས་པ་དང་ལྡན་པ། འཕོང་རྩལ་མཆོག་ཏུ་བྱུང་བ། མཚོན་ཆ་སྲ་བ་ཐོགས་པ། སྒྱུ་རྩལ་དྲུག་ཅུ་རྩ་བཞི་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ། བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐམས་ཅད་རྟོག་པར་རིག་པ།
en: As an analogy, Subhūti, supposing there was a heroic man, expert, steadfast, of fine physique, handsome, beautiful to behold, fair-complexioned, fully developed, and well trained in archery, who had also handled sharp weapons, perfected all the sixty-four crafts, fully mastered all the arts and fields of activity, and who was pleasing to many people and congenial.

source: འགྲོ་བ་མང་པོའི་ཡིད་དུ་འོང་ཞིང་སྡུག་པ་ནི་བྱ་བ་གང་དང་གང་རྩོམ་ཡང་ཐམས་ཅད་དུ་རྙེད་པ་ཆེན་པོ་དང་ལྡན་ཏེ་རྙེད་པ་དེས་སྐྱེ་བོ་མང་པོ་ལ་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ལ། དེ་ཤིན་དུ་དགའ་ཞིང་སྤྲོ་བ་དང་།
en: He would acquire great rewards in all the tasks he had to undertake and on account of those rewards, in the presence of many people, he would be served, respected, honored, and worshiped, causing him to greatly rejoice, in joy, utter joy, and comfort.

source: ཉམས་དགའ་ཞིང་ཡིད་བདེ་ནས་དགོས་པ་ཞིག་གི་ཕྱིར་ཕ་མ་དང་། བུ་དང་ཆུང་མ་དག་ཁྲིད་དེ་འབྲོག་དགོན་པ་བྱིས་པ་རྣམས་འཇིགས་ཤིང་སྐྱི་གཡའ་བར་སོང་སྟེ། སྐྱེས་བུ་དེས་དེར་ཕྱིན་ནས་ཕ་མ་དང་བུ་དང་ཆུང་མ་ལ་མི་འཇིགས་པ་བྱིན་ཏེ།
en: If he were then, for some purpose, to escort his parents, child, and wife, entering a hair-raising wilderness where childlike persons are afraid, on entering into it, that man would fearlessly exhort his parents, child, and wife, {Ki.

source: འཇིགས་པར་མ་བྱེད།
en: IV: 195} ‘Do not fear!

source: མ་འཇིགས་ཤིག །
en: Do not be afraid!

source: བདག་གིས་ཁྱེད་འབྲོག་དགོན་པ་འཇིགས་ཤིང་ཉམས་མི་བདེ་བ་འདི་ལས་མྱུར་དུ་གདོན་ཅིང་མྱུར་དུ་ཐར་པར་བྱའོ་ཞེས་མི་འཇིགས་པ་བྱིན་ཏེ།
en: I will swiftly get you out and swiftly release you from this fearful and uncomfortable wilderness.’

source: འབྲོག་དགོན་པ་དེར་སྐྱེས་བུ་དེ་ལ་གསོད་པའི་དགྲ་ཕྱིར་རྒོལ་བ་མང་པོ་ཉེ་བར་གནས་པར་གྱུར་ནས། སྐྱེས་བུ་དེ་ཡང་ཤེས་རབ་ཀྱི་མཐུ་དམ་པ་དང་ལྡན་པར་གྱུར་ཏེ། དེས་ཕ་མ་དང་བུ་དང་། །ཆུང་མ་དག་འབྲོག་དགོན་པ་དེ་ནས་བཏོན་ཏེ། བདེ་ཞིང་ཉོན་མ་མོངས་པར་ཐར་པར་བྱས་ནས་ཕྱིར་གྲོང་ངམ་གྲོང་ཁྱེར་རམ་གྲོང་རྡལ་ལམ་ལྗོངས་ཀྱི་འདབ་དུ་མ་སྣད་མ་ཉམས་པར་ཕྱིན་ནས་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ཏེ་དགྲ་ཕྱིར་རྒོལ་བའི་སེམས་ཅན་དེ་དག་ལ་ཡང་སེམས་ཀྱིས་སྡང་བར་མི་བྱེད་དེ།
en: Even if murderous enemies and many assailants were to harass him in that wilderness, he, being endowed with the supreme power of wisdom, would lead his parents, child, and wife from that wilderness and free them safely and without affliction, getting them back to a village, city, market town, or inhabited district, unharmed and uninjured, joyful and comfortable, and his mind would be without enmity toward those beings who were his enemies and assailants.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྐྱེས་བུ་དེས་སྒྱུ་རྩལ་ཐམས་ཅད་ལ་བྱང་བར་བྱས་པས། དེས་འབྲོག་དགོན་པ་དེར་ཕྱིར་རྒོལ་བ་དེ་དག་པས། ཕྱིར་རྒོལ་བ་གཞན་ཆེས་ཕལ་ཆེ་བ། ཆེས་མང་བ།
en: If you ask why, it is because that man has mastered all the crafts, in consequence of which he can in that wilderness conjure other assault forces that are for the most part more numerous, more heroic, and better armed than those assailants.

source: ཆེས་དཔའ་བ། ཆེས་མཚོན་ཆ་སྲ་བ་དང་ལྡན་པ་དག་སྤྲུལ་ཏེ། ཕྱིར་རྒོལ་བ་དེ་དག་ཐམས་ཅད་འཇིགས་པ་དེས་མེད་པར་གྱུར་ནས་སྐྱེས་བུ་དེས་ཕ་མ་དང་། བུ་དང་ཆུང་མ་དེ་དག་ཉོན་མོངས་པར་ཐར་བར་བྱས་ནས། བདེ་བར་རྣམ་པར་སྤྱོད་པ་ཞིག་ཡོད་ན།
en: All those assailants would disappear out of fear, and that man, having released his parents, child, and wife without affliction, would then dwell at ease. “

source: རབ་འབྱོར་དེ་བཞིན་དུ་གང་གི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པར་དམིགས་པའི་སེམས་དང་སྙིང་རྗེ་དང་དགའ་བ་དང་། བཏང་སྙོམས་སུ་དམིགས་པའི་སེམས་ཀྱིས་ཁྱབ་པར་བྱས་ནས་གནས་ཏེ་དེའི་སྐབས་སུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་བཞི་ལ་གནས་ཤིང་། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Similarly, Subhūti, when bodhisattva great beings maintain [a state of mind] imbued with thoughts that direct loving kindness, and with thoughts that direct compassion, empathetic joy, and equanimity toward all beings, at that time, those bodhisattva great beings are established in the four immeasurable attitudes and they complete the six perfections.

source: །ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་ཟག་པ་ཟད་པ་མ་ཐོབ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དོ།
en: After completing these, while not achieving the cessation of contaminants, they will investigate all-aspect omniscience.

source: །རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་གནས་ཤིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་དེ།
en: Established in the gateways to liberation—emptiness, signlessness, and wishlessness—they investigate all-aspect omniscience.

source: དེའི་སྐབས་སུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཚན་མས་ཀྱང་རྣམ་པར་མི་སྤྱོད། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གང་མངོན་དུ་བྱས་པས་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་འགྱུར་བ་དེ་ལྟ་བུ་ཡང་མངོན་དུ་མི་བྱེད་དོ།
en: At that time bodhisattva great beings do not course through signs, and they do not actualize any meditative stability of signlessness, so that they do not actualize anything that would cause them to dwell on the level of the śrāvakas or the level of the pratyekabuddhas. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། འདབ་ཆགས་བྱ་ནི་བར་སྣང་ལ་རྒྱུ་ཞིང་ས་ལ་མི་ལྟུང་སྟེ།
en: As an analogy, Subhūti, a bird moves through the air and does not fall to the ground.

source: ནམ་མཁའ་བར་སྣང་ལ་གནས་ཀྱང་དེ་ལ་གནས་པ་མེད་དོ།
en: It flies through the sky or the air but does not dwell in them.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཅིང་། སྟོང་པ་ཉིད་ལ་ཡང་རྣམ་པར་སྤྱོད། མཚན་མ་མེད་པ་དང་།
en: Similarly, Subhūti, bodhisattva great beings investigate emptiness, and they also course in emptiness.

source: སྨོན་པ་མེད་པ་ལ་ཡོངས་སུ་འདྲིས་པར་བྱེད་ཅིང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་ཡང་རྣམ་པར་སྤྱོད་དེ། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: They investigate signlessness and wishlessness, and they also course in signlessness and wishlessness.

source: སྨོན་པ་མེད་པ་གང་མངོན་དུ་བྱས་པས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་མ་རྫོགས་པར་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བར་འགྱུར་བ་ཡང་མངོན་དུ་མི་བྱེད་དེ།
en: But they do not actualize emptiness, signlessness, and wishlessness, which, when actualized, would cause them to lapse into the level of the śrāvakas or the level of the pratyekabuddhas, without perfecting the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas. {

source: སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་ལ་སྤྱད་ནས།
en: Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་མཐུ་དང་ལྡན་པ་འཕོང་རྩལ་གྱི་སློབ་དཔོན་དུ་གྱུར་པ། འཕོང་རྩལ་བསླབ་པ་ལ་ཤིན་དུ་བྱང་བ་ཞིག་ཡོད་ལ། དེས་མདའ་ཞིག་གནམ་དུ་འཕངས་ཏེ།
en: IV: 196} “As an analogy, Subhūti, when a powerful man who is a master of archery, extremely well trained in archery, fires an arrow far into the sky, and then fires a succession of other arrows, one after another, he can prevent that first arrow from falling to the ground.

source: མདའ་དེ་གནམ་དུ་འཕངས་ནས། མདའ་གཞན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དེ་འཕངས་པས་མདའ་སྔ་མ་དེ་ས་ལ་ལྟུང་དུ་མ་བཅུག་སྟེ། དེ་ཇི་སྲིད་དུ་སྐྱེས་བུ་དེས་ད་ནི་མདའ་འདི་ས་ལ་ལྟུང་བར་བྱའོ་སྙམ་དུ་འདོད་པར་མ་བྱས་པས་དེ་སྲིད་དུ་མདའ་དེ་ས་ལ་མི་ལྟུང་སྟེ།
en: Indeed, it will not fall to the ground as long as he does not make the wish, ‘Now I should let that arrow fall to the ground!’

source: ནམ་མདའ་ཕྱི་མ་མ་འཕངས་པ་དེའི་ཚེ། མདའ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་དག་ས་ལ་ལྟུང་ངོ་།
en: But when he ceases to fire the subsequent arrows, the arrows would all fall to the ground in succession, one after the other.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་མཁས་པས་ཡོངས་སུ་བཟུང་བ་ཡང་ཇི་སྲིད་དུ་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་ཡང་དག་པའི་མཐའ་དམ་པ་མངོན་དུ་མི་བྱེད་དོ།
en: Similarly, Subhūti, as long as bodhisattva great beings practice the perfection of wisdom that is retained by skill in means, they do not actualize the genuine very limit of reality until the roots of virtuous action have been brought to maturity in unsurpassed, complete enlightenment.

source: །ནམ་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་གྱུར་པ་དེ་ནི་ཡང་དག་པའི་མཐའ་དམ་པ་མངོན་དུ་བྱེད་དོ།
en: But when those roots of virtuous action have been brought to maturity in unsurpassed, complete enlightenment, they do actualize the authentic very limit of reality.

source: །རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ཆོས་དེ་དག་གི་ཆོས་ཉིད་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཆོས་ཉིད་འདི་ལ་སློབ་པ། ཡང་དག་པའི་མཐའ་ལ་སློབ་པ།
en: So it is, Subhūti, that bodhisattva great beings who practice the perfection of wisdom should make a definitive analysis in accord with the reality of these phenomena.”

source: དེ་བཞིན་ཉིད་ལ་སློབ་པ། ཆོས་ཀྱི་དབྱིངས་ལ་སློབ་པ། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སློབ་པ། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་སློབ་ཅིང་བར་མ་དོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཉམས་པར་མི་འགྱུར་བ་ནི་དཀའ་བ་བགྱིད་པ་སྟེ། བཅོམ་ལྡན་འདས་ངོ་མཚར་ཆེའོ།
en: Then [the venerable Subhūti] said, “Blessed Lord, how wonderful it is, Blessed Lord, that while bodhisattva great beings train in this reality, train in the very limit of reality, train in the real nature, train in the realm of phenomena, train in [the aspects of emptiness], up to and including the emptiness of independent characteristics, and train in the three gateways to liberation, the difficult achievement is that they do not lapse in the interim from unsurpassed, complete enlightenment.

source: །བདེ་བར་གཤེགས་པ་ཤིན་ཏུ་ངོ་མཚར་ཆེའོ།
en: Sugata, this is most amazing!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་བཏང་བའི་ཕྱིར་ཏེ།
en: Subhūti,” replied the Blessed One, “this is because such bodhisattva great beings do not forsake any beings.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་བཏང་བ་དེ་དག་གི་སྨོན་ལམ་གྱི་ཁྱད་པར་ནི་རྣམ་པ་དེ་ལྟ་བུར་འགྱུར་རོ།
en: Subhūti, such are the extraordinary aspirations of those bodhisattva great beings who have not forsaken any beings.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སེམས་ཅན་ཐམས་ཅད་ནི་བདག་གིས་ཡོངས་སུ་མ་བཏང་སྟེ་དམ་པ་མ་ཡིན་པའི་ཆོས་ལ་གནས་པ་འདི་དག་ནི་བདག་གིས་ཡོངས་སུ་དགྲོལ་བར་བྱའོ་ཞེས་དེ་ལྟ་བུའི་སེམས་མངོན་པར་སྒྲུབ་ཅིང་།
en: Subhūti, those bodhisattva great beings magnanimously think, ‘I will not forsake any beings. I should release all these beings who maintain inauthentic doctrines.’

source: ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དང་ལྡན་པར་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་མངོན་པར་བསྒྲུབ་པ་དང་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་མངོན་པར་བསྒྲུབ་པ་དང་རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་མངོན་པར་བསྒྲུབ་པ་དེའི་ཚེ་ཇི་སྲིད་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཐོབ་ཀྱི་བར་དུ་བར་མ་དོར་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་པར་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གི་ཚེ་འདི་ལྟ་སྟེ།
en: When bodhisattva great beings skillfully actualize the meditative stability of emptiness as a gateway to liberation, when they actualize the meditative stability of signlessness as a gateway to liberation, and when they actualize the meditative stability of wishlessness as a gateway to liberation, one should know that they do not actualize the very limit of reality in the interim until they have attained all-aspect omniscience. “

source: ནང་སྟོང་པ་ཉིད་དང་ཕྱི་སྟོང་པ་ཉིད་དང་ཕྱི་ནང་སྟོང་པ་ཉིད་དང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་།
en: Moreover, Subhūti, when bodhisattva great beings seek to analyze the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of both external and internal phenomena, [and the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, {Ki.

source: དྲན་པ་ཉེ་བར་གཞག་པ་དང་ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་གནས་ཟབ་མོ་དེ་དག་ལ་བརྟག་པར་འདོད་པར་གྱུར་ན། དེས་འདི་ལྟར་འདི་སྙམ་དུ་སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་བདག་ཏུ་འདུ་ཤེས་པ་དང་། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང་། སྲོག་ཏུ་འདུ་ཤེས་པ་དང་། འགྲོ་བར་འདུ་ཤེས་པ་དང་། གསོ་བར་འདུ་ཤེས་པ་དང་། སྐྱེས་བུར་འདུ་ཤེས་པ་དང་གང་ཟག་ཏུ་འདུ་ཤེས་པ་དང་། ཤེད་ཅན་དུ་འདུ་ཤེས་པ་དང་། ཤེད་བདག་ཏུ་འདུ་ཤེས་པ་དང་། བྱེད་པ་པོར་འདུ་ཤེས་པ་དང་། ཚོར་བ་པོར་འདུ་ཤེས་པ་དང་། འཇུག་པ་པོར་འདུ་ཤེས་པས་དམིགས་པ་ལ་སྤྱོད་ཀྱིས། དེ་དག་གི་དམིགས་པ་སྤོང་བའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། ཆོས་བསྟན་པར་བྱའོ་སྙམ་དུ་སེམས། མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: IV: 197} as well as the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the three gateways to liberation, and those [other] profound topics, they magnanimously think, ‘I will attain consummate buddhahood in unsurpassed, complete enlightenment, and teach the Dharma in order that these beings—who, over a long period of time, have been practicing by way of apprehending, owing to the notion of self, the notion of beings, the notion of life forms, the notion of living beings, the notion of life, the notion of living creatures, the notion of individual personalities, the notion of human beings, the notion of people, the notion of actors, the notion of experiencers, and the notion of the experiencing subject—might abandon their apprehendings!’

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་ཀྱང་ཡང་དག་པའི་མཐའ་གང་མངོན་དུ་བྱས་པས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: At that time, even though bodhisattva great beings become absorbed in the meditative stabilities of emptiness, signlessness, and wishlessness—the gateways to liberation—they do not actualize the very limit of reality through which the fruit of entering the stream to nirvāṇa is attained, through which the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship are attained, and through which individual enlightenment is attained. “

source: དགྲ་བཅོམ་པ་ཉིད་འཐོབ་པ་དང་། རང་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་བ་མངོན་དུ་མི་བྱེད་དོ། །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་བསྐྱེད་པ་དེ་དང་དགེ་བའི་རྩ་བ་དེ་དག་དང་ཐབས་མཁས་པ་དང་ལྡན་པ་ནི་བར་མ་དོར་ཡང་དག་པའི་མཐའ་ཡང་མངོན་དུ་མི་བྱེད་དེ།
en: Subhūti, bodhisattva great beings who set their minds on enlightenment in that manner, who possess the roots of virtuous action and are endowed with skillful means, will also not, in the interim, actualize the very limit of reality.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Nor will the perfection of generosity be diminished.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Nor will the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom be diminished.

source: །ནང་སྟོང་པ་ཉིད་དང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Nor will the emptiness of internal phenomena [and the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, be diminished.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Nor will the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, or the noble eightfold path be diminished.

source: །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཡང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Nor will the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions be diminished.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ། །མངོན་པར་ཤེས་པ་ལྔ་དང་ཏིང་ངེ་འཛིན་དང་།
en: Nor will the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, or wishlessness be diminished.

source: གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Nor will the five extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, or unsurpassed, complete enlightenment be diminished. “

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་ལྡན་པ་ཡིན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་ཏེ།
en: Subhūti, so it is that when bodhisattva great beings are endowed with the factors conducive to enlightenment, they will not be diminished until they have attained consummate buddhahood in unsurpassed, complete enlightenment.

source: ཐབས་མཁས་པས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་རྣམ་པར་འཕེལ་ཞིང་དེའི་དབང་པོ་རྣམས་ཀྱང་ཆེས་རྣོ་བར་འགྱུར་ཏེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ལྟ་བུ་མ་ཡིན་པར་འགྱུར་རོ།
en: Those bodhisattva great beings who have been favored with skill in means {Ki.IV: 198} are enhanced by virtuous attributes, and their sense faculties become keener, unlike the sense faculties of śrāvakas and pratyekabuddhas. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་སྙམ་སྟེ་སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་ཕྱིན་ཅི་ལོག་བཞི་ལ་སྤྱོད་སྤྱོད་པ། རྟག་པར་འདུ་ཤེས་པ་དང་། བདེ་བར་འདུ་ཤེས་པ་དང་བདག་ཏུ་འདུ་ཤེས་པ་དང་།
en: Moreover, Subhūti, bodhisattva great beings think, ‘For a long period of time these beings have been engaging in four misconceptions, namely the notion of permanence, the notion of happiness, the notion of self, and the notion that existence is pleasant.

source: སྡུག་པར་འདུ་ཤེས་པ་ལ་སྤྱོད་སྤྱོད་པ་ཡིན་གྱིས་དེ་དག་གི་ཕྱིར་བྱང་ཆུབ་ཏུ་སྤྱད་པར་བྱའོ།
en: So I should attain enlightenment for their sake.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན། ཅི་ནས་ཀྱང་རྟག་ཅེས་བྱ་བ་འམ་བདེ་ཞེས་བྱ་བ་འམ་བདག་ཅེས་བྱ་བ་འམ། སྡུག་ཅེས་བྱ་བའི་ཡོངས་སུ་རྒྱུ་བ་མེད་པར་ཆོས་བསྟན་པར་བྱའོ་སྙམ་སྟེ།
en: When I have attained consummate buddhahood in unsurpassed, complete enlightenment, by whatever means I should teach them the Dharma that the notion of permanence, the notion of happiness, the notion of self, and the notion of the pleasant are without basis.’

source: སེམས་བསྐྱེད་པ་དེ་ལྟ་བུ་དག་དང་ལྡན་ལ་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་མ་རྫོགས། མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་མ་རྫོགས་པར་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་དོ།
en: Since they have set their minds accordingly on enlightenment and practice the perfection of wisdom through skill in means, they will not actualize the very limit of reality until they have perfected the ten powers of the tathāgatas, and until they have perfected the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, great loving kindness, and great compassion.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཀྱི་བར་དུ་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱེད་དོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་སྙམ་དུ་སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་དམིགས་པ་ལ་སྤྱོད་སྤྱོད་པ་སྟེ་བདག་ཅེས་བྱ་བ་འམ་སེམས་ཅན་དང་སྲོག་དང་འགྲོ་བ་དང་གསོ་བ་དང་སྐྱེས་བུ་དང་། གང་ཟག་དང་ཤེད་ཅན་དང་ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་མཐོང་བ་པོ་ཞེས་བྱ་བ་འམ། གཟུགས་ཤེས་བྱ་བ་འམ། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འམ། སྐྱེ་མཆེད་ཅེས་བྱ་བ་འམ། ཁམས་ཤེས་བྱ་བ་འམ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ་བ་འམ།
en: At that time, even though bodhisattva great beings may have become absorbed in the meditative stabilities of emptiness, signlessness, and wishlessness—the gateways of liberation—they will not actualize the very limit of reality until they have attained consummate buddhahood in unsurpassed, complete enlightenment. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཤེས་བྱ་བ་འམ་སྟོང་པ་ཉིད་རྣམས་ཤེས་བྱ་བ་འམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཤེས་བྱ་བ་འམ། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཞེས་བྱ་བ་འམ་རྣམ་པར་ཐར་པ་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཞེས་བྱ་བ་འམ། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ཞེས་བྱ་བ་འམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་།
en: Moreover, Subhūti, bodhisattva great beings think, ‘For a long period of time these beings have engaged, by way of apprehending, in the concept of self; or the concepts of sentient beings, life forms, living beings, life, living creatures, individual personalities, human beings, people, actors, experiencers, knowers, and viewers; or the concept of physical forms; or the concepts of feelings, perceptions, formative predispositions, and consciousness; or the concept of the sense fields, the concept of the sensory elements, the concept of the links of dependent origination, the concept of the perfections, the concept of the aspects of emptiness, the concept of the factors conducive to enlightenment, and the concepts of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; or the concepts of the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness; or the concepts of the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; or the concepts of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.
